import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

class Main {
    public static void main(String[] args) throws IOException {
        BufferedReader r = new BufferedReader(new InputStreamReader(System.in));
        byte from = Byte.parseByte(r.readLine());
        byte to = Byte.parseByte(r.readLine());
        byte i = 0, j = from;
        for (; j <= to; j++) {
            System.out.println(Group.IP20_1[i] + "  " + j);
            ++i;
            if (i == 29) break;
            if (j == to) j = (byte) (from - 1);
        }
    }
}    

class Group {
    public static String[] IP20_1 = {"1.Б'єсик Володимир Михайлович", "2.Васкул Тарас Миколайович", "3.Вовчук Назар Ігорович", 
    "4.Габіцький Роман Ігорович", "5.Гах Валентин Миронович", "6.Гладюк Андрій Ростиславович", "7.Гоголь Василь Іванович", 
    "8.Гоголь Назарій Миколайович", "9.Дичка Микола Миколайович", "10.Дуденчук Віталій Васильович", "11.Івасишин Роман Васильович", 
    "12.Казімірко Володимир Ігорович", "13.Капітан Владислав Петрович", "14.Керницька Софія Василівна", "15.Кобилянська Ілона Василівна", 
    "16.Кушик Андрій Михайлович", "17.Лакомський Вадим Ігорович", "18.Маланчук Роман Михайлович", "19.Марина Юрій Юрійович", 
    "20.Микитенко Максим Володимирович ", "21.Михайлович Василь Вікторович", "22.Мінаєв Владислав Олександрович", 
    "23.Ничик Богдан Ігорович", "24.Петрів Соломія Богданівна", "25.Ріпський Владислав Андрійович", 
    "26.Сінітович Олег Васильович", "27.Солнцев Олександр Юрійович", "28.Фокащук Денис Романович", "29.Щербатий Анатолій Романович"};
}